conf/src/Documents/ЭП_УтверждениеФактическихТрудозатрат/ЭП_УтверждениеФактическихТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_УтверждениеФактическихТрудозатрат</name>
  <registerRecords>InformationRegister.ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ЭП_ВидыОперацийНадФактическимиТрудозатратами</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ЭП_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/УчетВремени/УчетВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетВремени</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Enums/ЭП_ВидыОперацийНадФактическимиТрудозатратами/ЭП_ВидыОперацийНадФактическимиТрудозатратами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыОперацийНадФактическимиТрудозатратами</name>
  <enumValues>
    <name>ТрудозатратыКоманды</name>
  </enumValues>
  <enumValues>
    <name>ТрудозатратыРП</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_ГенерацияЗаписейВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Documents/ЭП_УтверждениеФактическихТрудозатрат/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных
//Перем ПериодРегистрации; 
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДатаСеанса(); 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Элементы.Дата.Заголовок = ЗаголовокПериодаЗатратВремени(); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	 // СтандартныеПодсистемы.УправлениеДоступом
    УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	 // СтандартныеПодсистемы.УправлениеДоступом
    Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
        МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
        МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    КонецЕсли;
    // Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	
	Элементы.Дата.Заголовок = ЗаголовокПериодаЗатратВремени();
	
	Если Объект.Проект.Пустая() ИЛИ Объект.ВидОперации.Пустая() Тогда
		Объект.Сотрудники.Очистить();
		Возврат;
	КонецЕсли;
		
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыКоманды") Тогда
		Объект.Дата = КонецНедели(ТекущаяДата());
	Иначе 
		Объект.Дата = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
	ЗаполнитьТрудозатратыПоУчетуВремени();
	
КонецПроцедуры 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)  
	
	Если Объект.Проект.Пустая() ИЛИ Объект.ВидОперации.Пустая() Тогда
		Объект.Сотрудники.Очистить();
		Возврат;
	КонецЕсли;  
	
	ЗаполнитьТрудозатратыПоУчетуВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)  
	
	Если Объект.Проект.Пустая() ИЛИ Объект.ВидОперации.Пустая() Тогда
		Объект.Сотрудники.Очистить();
		Возврат;
	КонецЕсли;  
	
	ЗаполнитьТрудозатратыПоУчетуВремени();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандТаблицыФормыСотрудники

&НаКлиенте
Процедура СформироватьДетализациюПоПроекту(Команда)
	
	ФормаОтчета = ПолучитьФорму("Отчет.ЭП_ТрудозатратыКоманды.Форма");
	КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = ПериодОтчета().ДатаНачала;
	Период.ДатаОкончания = ПериодОтчета().ДатаОкончания;
		
	СписокСотрудников = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Объект.Сотрудники Цикл
	
		СписокСотрудников.Добавить(СтрокаТЧ.Сотрудник);
	
	КонецЦикла;
	
	УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, "ПериодОтчета", Период);
	УстановитьПользовательскийОтборСКД(КомпоновщикНастроек, "Сотрудник", СписокСотрудников, ВидСравненияКомпоновкиДанных.ВСписке);
	УстановитьПользовательскийОтборСКД(КомпоновщикНастроек, "Проект", Объект.Проект);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "Основной");
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	ОткрытьФорму("Отчет.ЭП_ТрудозатратыКоманды.Форма", ПараметрыФормы, ЭтаФорма);	
	
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьДетализациюПоСотруднику(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	ФормаОтчета = ПолучитьФорму("Отчет.ЭП_ДетализацияУчетаВремени.Форма");
	КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = ПериодОтчета().ДатаНачала;
	Период.ДатаОкончания = ПериодОтчета().ДатаОкончания;
	
	УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, "Период", Период);
	УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, "Пользователь", НайтиПользователя(ТекущиеДанные.Сотрудник));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "ОсновнойДляФактическихТрудозатрат");
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	ОткрытьФорму("Отчет.ЭП_ДетализацияУчетаВремени.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	Объект.Сотрудники.Очистить();
	
	Если Объект.Проект.Пустая() ИЛИ Объект.ВидОперации.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТрудозатратыПоУчетуВремени();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТрудозатратыПоУчетуВремени()
	
	Запрос = Новый Запрос;     
	Запрос.УстановитьПараметр("КонецПериода",Объект.Дата);
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	Если Объект.ВидОперации = Перечисления.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыКоманды Тогда
	 	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетВремениОбороты.Пользователь.ЭП_Сотрудник КАК Сотрудник,
		|	СУММА(УчетВремениОбороты.ДлительностьОборот / 3600) КАК Часы
		|ИЗ
		|	РегистрНакопления.УчетВремени.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			НЕ Проект.Ответственный = Пользователь
		|				И Проект = &Проект) КАК УчетВремениОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетВремениОбороты.Пользователь.ЭП_Сотрудник";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоНедели(Объект.Дата));
				
	Иначе 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетВремениОбороты.Пользователь.ЭП_Сотрудник КАК Сотрудник,
		|	СУММА(УчетВремениОбороты.ДлительностьОборот / 3600) КАК Часы
		|ИЗ
		|	РегистрНакопления.УчетВремени.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Проект.Ответственный = Пользователь
		|				И Проект = &Проект) КАК УчетВремениОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетВремениОбороты.Пользователь.ЭП_Сотрудник";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
		
	КонецЕсли;
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Объект.Сотрудники.Загрузить(Выгрузка);   
	
КонецПроцедуры

//Получение заголовка элемента шапки формы "Дата"
&НаКлиенте
Функция ЗаголовокПериодаЗатратВремени()   
	
	Заголовок = "Затраты времени за";
	
	Если Объект.ВидОперации.Пустая() Тогда
		Возврат Заголовок;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыКоманды") Тогда
		Заголовок = "Затраты времени за неделю"; 
		Объект.Дата = КонецНедели(Объект.Дата);
	Иначе 
		Заголовок = "Затраты времени за месяц";
		Объект.Дата = КонецМесяца(Объект.Дата);
	КонецЕсли;
		
	Возврат Заголовок;

КонецФункции  


&НаСервереБезКонтекста
Функция НайтиПользователя(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Пользователи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ЭП_Сотрудник = &ЭП_Сотрудник";
	Запрос.УстановитьПараметр("ЭП_Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка.Ссылка;

КонецФункции

&НаСервере
Функция ПериодОтчета()
	
	Если Объект.ВидОперации = Перечисления.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыКоманды Тогда
		ДатаНачала = НачалоНедели(Объект.Дата);
		ДатаОкончания = КонецНедели(Объект.Дата);
	ИначеЕсли Объект.ВидОперации = Перечисления.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыРП Тогда 
		ДатаНачала = Началомесяца(Объект.Дата);
		ДатаОкончания = КонецМесяца(Объект.Дата);		
	КонецЕсли; 
	
	Период = Новый Структура("ДатаНачала, ДатаОкончания", ДатаНачала, ДатаОкончания);
	
	Возврат Период;
	
КонецФункции


&НаКлиенте
Процедура УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, ИмяПараметра, Значение)
	
	Перем ПараметрДанных, Настройки, ПользовательскиеНастройки, ПользовательскийПараметр;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ПараметрДанных = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если ЗначениеЗаполнено(ПараметрДанных.ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
		ПользовательскийПараметр = ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		ПользовательскийПараметр.Использование = Истина;
		ПользовательскийПараметр.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПользовательскийОтборСКД(КомпоновщикНастроек, ИмяОтбора, Значение, ВидСравнения = Неопределено)
	
	Перем	ПолеКД, Элем, ЭлементОтбора, Настройки, 
			ПользовательскиеНастройки, ПользовательскийОтбор;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ПолеКД = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	
	Для Каждого Элем Из Настройки.Отбор.Элементы Цикл
		
		Если Элем.ЛевоеЗначение = ПолеКД Тогда
			ЭлементОтбора = Элем;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		Возврат;		
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
 		ПользовательскийОтбор = ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		ПользовательскийОтбор.Использование = (Значение <> Неопределено);
		ПользовательскийОтбор.ВидСравнения = ?(ВидСравнения <> Неопределено, ВидСравнения, ВидСравненияКомпоновкиДанных.Равно); 
		ПользовательскийОтбор.ПравоеЗначение  = Значение;
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти
